<?php
return [
    '1'=>'成功',
    '999001'=>'傳入參數不足或傳入參數格式錯誤',
    '999004'=>'lang參數錯誤 or 不存在',
    '999005'=>'傳送方法錯誤',
    '999006'=>'Content-Type錯誤',
    '999007'=>'傳入的json格式錯誤, Server端無法解析',
    '999008'=>'Signature驗證碼不正確',
    '999009'=>'禁止存取API',
    '999010'=>'app-key參數錯誤',
    '999011'=>'signature參數錯誤或誤差超過15分鐘',
    '999999'=>'其他未知錯誤',
    '997901'=>'欄位長度太長',
    '997902'=>'必填欄位缺失',
    '997903'=>'欄位格式錯誤',
    '997904'=>'帳號不存在',
    '997907'=>'上傳類型不符規定',
    '997908'=>'上傳檔案超過大小限制',
    '997909'=>'查無檔案可刪除',
    '997910'=>'uuid不存在',
    '997998'=>'沒有權限刪除此檔案',
    '997999'=>'其他未知錯誤'
];