<?php
return [
    '1'=>'成功',
    '999001'=>'传入参数不足或传入参数格式错误',
    '999004'=>'lang参数错误 or 不存在',
    '999005'=>'传送方法错误',
    '999006'=>'Content-Type错误',
    '999007'=>'传入的json格式错误, Server端无法解析',
    '999008'=>'Signature验证码不正确',
    '999009'=>'禁止存取API',
    '999010'=>'app-key参数错误',
    '999011'=>'signature参数错误或误差超过15分钟',
    '999999'=>'其他未知错误',
    '997901'=>'字段长度太长',
    '997902'=>'必填字段缺失',
    '997903'=>'字段格式错误',
    '997904'=>'账号不存在',
    '997907'=>'上传类型不符规定',
    '997908'=>'上传档案超过大小限制',
    '997909'=>'查无档案可删除',
    '997910'=>'uuid不存在',
    '997998'=>'没有权限删除此档案',
    '997999'=>'其他未知错误'
];